{"Tasks":[{"Title":"Edit functionality for tasks","Description":"The 'Edit' button below should lead to the edit functionality of a task.<br />Build everything needed so the user can edit an existing task.","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"0215f405-001a-4f1f-b844-083f5d822791"},{"Title":"Store DateCreated, LastUpdated, UserCreatedId, UserLastUpdatedId for all datatypes","Description":"Make sure the database stores for all data types the date and time when an entry was created and last updated<br />Also store the user which created and last updated an element in the database.","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"17bf3723-3801-4e16-bd6d-a87e3463c27a"},{"Title":"Build authentication functionality","Description":"The Login functionality already exists<br />In the login form a user can enter username and password (use username: candidate and password: candidate for your tests), when the credentials were correct, the backend stores the user id of the current user in a cookie in the browser.<br />When the user clicks logout, the cookie is deleted.<br />Now build the functionality which ensures the following:<br />-tasks can only be seen if logged in<br />-a user can only see/edit/delete the tasks that are assigned to it<br />-a user with the role administrator can see every task<br />-only logged in users can create tasks<br />-if a creator of a task doesn't assign it, it will be assigned to the creator","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"d396ef5f-f585-4775-9540-8ab012441ef9"},{"Title":"Build commentary function","Description":"Build a function which allows to comment in tasks.<br />The UI should display all comments (with the create date and the user who created it).","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"0dd32ec3-1152-4e57-bbb3-5f0faae99249"},{"Title":"Answer questions about the architecture of the solution","Description":"Answer the questions below in the comments of the task (if you didn't build the comments module just add your answers in a text file to the git repository):<br />Would you use the architecture of the solution (or parts of it) in a real project?<br />Why would you use which parts of the solution? Why not?<br />What would you change? How would you change it?","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"cc6b8236-b4e1-4da9-bc05-a4640ea73433"},{"Title":"Review the work of the interview candidate","Description":"This task is not for you as the candidate of the interview<br />It is here for you to check if the authorization works cause it is assigned to the interviewer.<br />When you fix the authorization task you should not see this anymore as a candidate.","IsFinished":false,"AssignedUserId":"a22663f6-73d0-4330-b157-f92c70cb0a6b","Id":"5ede8fd2-614a-4177-874c-183af4aecab1"},{"Title":"Start the Solution from your Visual Studio","Description":"Well done! If you see this task in your browser you already finished the first task.<br />Now you can start with the tasks below mark it later as finished when you built the functionality for it.<br />Make sure you follow the development guidelines from the Readme.md in the root of this solution.<br />Good luck!","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"7bd3d029-5627-4f1f-a5af-56529b9fc32f"},{"Title":"Refactor TaskLogic","Description":"Voyon.DotNet.Interview.Logic.BL.TaskLogic has some flaws and needs a refactor.<br />Keep the functionality of all the methods but make sure its clean code.","IsFinished":false,"AssignedUserId":"7997404d-8991-4eec-83c7-d4794e23921a","Id":"1241d243-8023-436e-a498-e0afb0592bad"}],"Roles":[{"Name":"administrator","Id":"499a2f71-e07c-439a-8214-e7a7d2ca9977"},{"Name":"editor","Id":"47692f10-81b2-4a40-b281-17ecadfddfef"}],"Users":[{"Username":"interviewer","Password":"interviewer","Id":"a22663f6-73d0-4330-b157-f92c70cb0a6b"},{"Username":"candidate","Password":"candidate","Id":"7997404d-8991-4eec-83c7-d4794e23921a"}],"UserRoles":[{"UserId":"a22663f6-73d0-4330-b157-f92c70cb0a6b","RoleId":"499a2f71-e07c-439a-8214-e7a7d2ca9977","Id":"00000000-0000-0000-0000-000000000000"},{"UserId":"7997404d-8991-4eec-83c7-d4794e23921a","RoleId":"47692f10-81b2-4a40-b281-17ecadfddfef","Id":"00000000-0000-0000-0000-000000000000"}]}